Hi @krowlandson  - results of testing over 12 hour period:

- Same effect in both eastasia and southeastasia azure regions, so doesn't look like a regional resource/api latency issue
- It seems terraform is creating the VNET resource in the wrong subscription, while registering it in tfstate as existing in another subscription, see below



- Failure to deploy all `azurerm_private_dns_zone_virtual_network_link` resources:


```
╷
│ Error: creating/updating Virtual Network Link (Subscription: "yyyyyyyy-31a8-4859-832f-894fb9ab7831"
│ Resource Group Name: "engeneon-dns"
│ Private Zone Name: "privatelink.adf.azure.com"
│ Virtual Network Link Name: "xxxxxxxx-4192-436a-8068-d294f693d8d3-393893ec-7624-5931-b332-a27cb0ca15a9"): polling after CreateOrUpdate: Code="BadRequest" Message="Virtual network resource not found for '/subscriptions/xxxxxxxx-4192-436a-8068-d294f693d8d3/resourceGroups/engeneon-connectivity-southeastasia/providers/Microsoft.Network/virtualNetworks/engeneon-hub-southeastasia'"
│ 
│   with module.enterprise_scale.azurerm_private_dns_zone_virtual_network_link.connectivity["/subscriptions/xxxxxxxx-4192-436a-8068-d294f693d8d3/resourceGroups/engeneon-dns/providers/Microsoft.Network/privateDnsZones/privatelink.adf.azure.com/virtualNetworkLinks/xxxxxxxx-4192-436a-8068-d294f693d8d3-393893ec-7624-5931-b332-a27cb0ca15a9"],
│   on .terraform/modules/enterprise_scale/resources.connectivity.tf line 482, in resource "azurerm_private_dns_zone_virtual_network_link" "connectivity":
│  482: resource "azurerm_private_dns_zone_virtual_network_link" "connectivity" {
│ 
```

Here terraform is looking for a VNET resource in suscription `xxxxxxxx-4192-436a-8068-d294f693d8d3`, which is designated as the connectivity subscription. Creation of all private links fail upon not finding this vnet.


- Terraform plan, after clean destroy, indicates it's going to deploy a VNET in the *connectivity* subscription (despite the fact that the VNET ends up in the `management` subscription instead):


```

  # module.enterprise_scale.azurerm_virtual_network.connectivity["/subscriptions/xxxxxxxx-4192-436a-8068-d294f693d8d3/resourceGroups/engeneon-connectivity-southeastasia/providers/Microsoft.Network/virtualNetworks/engeneon-hub-southeastasia"] will be created
  + resource "azurerm_virtual_network" "connectivity" {
      + address_space       = [
          + "10.100.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "engeneon-hub-southeastasia"
      + resource_group_name = "engeneon-connectivity-southeastasia"
      + subnet              = (known after apply)
      + tags                = {
          + "deployedBy" = "terraform/azure/caf-enterprise-scale"
        }
    }

```


- According to the state, the vnet was created successfully and in the correct network subscription (xxxxxxxx-4192-436a-8068-d294f693d8d3/):


```
(base) welcome@Traianos-MacBook-Pro azure-caf-implementation % terraform state list | egrep -i virtual_network

module.enterprise_scale.azurerm_virtual_network.connectivity["/subscriptions/xxxxxxxx-4192-436a-8068-d294f693d8d3/resourceGroups/engeneon-connectivity-southeastasia/providers/Microsoft.Network/virtualNetworks/engeneon-hub-southeastasia"]
```


However it appears the VNET is being created in the management subscription fopr some unknown reason (`yyyyyyyy-31a8-4859-832f-894fb9ab7831`):


```
az network vnet list | less 

[
  {
    "addressSpace": {
      "addressPrefixes": [
        "10.100.0.0/16"
      ]
    },
    "bgpCommunities": null,
    "ddosProtectionPlan": null,
    "dhcpOptions": {
      "dnsServers": []
    },
    "enableDdosProtection": false,
    "enableVmProtection": null,
    "encryption": null,
    "etag": "W/\"zzzzzzzz-8528-4409-9ead-11c3dee83198\"",
    "extendedLocation": null,
    "flowTimeoutInMinutes": null,
    "id": "/subscriptions/yyyyyyyy-31a8-4859-832f-894fb9ab7831/resourceGroups/engeneon-connectivity-southeastasia/providers/Microsoft.Network/virtualNetworks/engeneon-hub-southeastasia",
    "ipAllocations": null,
    "location": "southeastasia",
    "name": "engeneon-hub-southeastasia",
    "provisioningState": "Succeeded",
    "resourceGroup": "engeneon-connectivity-southeastasia",
    "resourceGuid": "3a298bb8-3c1c-4234-aa86-386f8994b882",
```

Not sure why the state would show the resource created in one subscription while it exists in another:

- terraform plan/apply executed while switched into the management subscription;

```
(base) welcome@Traianos-MacBook-Pro azure-caf-implementation % az account list -o table
Name                   CloudName    SubscriptionId                        State    IsDefault
---------------------  -----------  ------------------------------------  -------  -----------
Pay-As-You-Go          AzureCloud   zzzzzzz-55d4-453f-a7ad-17327cff8f01  Enabled  False
hkjc-management-000    AzureCloud   xxxxxxx-4859-832f-894fb9ab7831  Enabled  True
hkjc-connectivity-000  AzureCloud   yyyyyyy-436a-8068-d294f693d8d3  Enabled  False

```

- terraform configuration designates the management subscription and connectivity suscription;


```
provider "azurerm" {
  features {}
}

//The below provider blocks are required for every participating subscription
provider "azurerm" {
  alias           = "connectivity"
  subscription_id = "xxxxxxxx-4192-436a-8068-d294f693d8d3"
  features {}
}

# Declare a standard provider block using your preferred configuration.
# This will be used for the deployment of all "Management resources" to the specified `subscription_id`.

provider "azurerm" {
  alias           = "management"
  subscription_id = "yyyyyyyy-31a8-4859-832f-894fb9ab7831"
  features {}
}

```




